
class MyDataSet {
    var name = ["美女1","草莓2","草莓3","美女2","照片","三只狗","四只狗","雄鸡报晓","教子加官","荔枝","三千年之果"]
    var country = ["中国","日本","美国","英国","China","法国","德国","英国","中国","四川","山东"]
    var imagename=["beauty1","berry2","berry3","beauty2","me","dog1","dog2","chicken","chicken2","lizhi","peach"]
    var type = ["女人","水果","水果","女人","人物","动物","动物","绘画","绘画","绘画","绘画"]
    var favstateArray=Array(repeating: false, count:11 )
    var text = ["hello, how are you? 大江东去，浪淘尽，千古风流人物，故垒西边，人道是三国周郎赤壁，乱石穿空，惊涛拍岸，卷起千堆雪，江山如画，一时多少豪杰。","水果berry","水果berry","女人zhangsnjjbh asfhoa hfaosfhoohj 火锅没人来，没滋味山东人真捧场","人物","动物","动物","绘画","绘画","绘画",
"""
春江花月夜
春江潮水连海平，海上明月共潮生。
滟滟随波千万里，何处春江无月明！
江流宛转绕芳甸，月照花林皆似霰3。
空里流霜不觉飞4，汀上白沙看不见5。
江天一色无纤尘6，皎皎空中孤月轮7。
江畔何人初见月？江月何年初照人？
人生代代无穷已8，江月年年望相似9。
不知江月待何人，但见长江送流水10。
白云一片去悠悠11，青枫浦上不胜愁12。
谁家今夜扁舟子13？何处相思明月楼14？
可怜楼上月徘徊15，应照离人妆镜台16。
玉户帘中卷不去17，捣衣砧上拂还来18。
此时相望不相闻19，愿逐月华流照君20。
鸿雁长飞光不度，鱼龙潜跃水成文21。
昨夜闲潭梦落花22，可怜春半不还家。
江水流春去欲尽，江潭落月复西斜。
斜月沉沉藏海雾，碣石潇湘无限路23。
不知乘月几人归24，落月摇情满江树25。
"""]
}



